{"id":"hwst98f","author":"thisguyisbarry","comment":"-> Sponsored by the National Dairy Council \n\nI am one feverish milk drinker however."}
{"id":"hwsrua9","author":"W0lf87","comment":"Yes"}
{"id":"hwt671m","author":"wrapchap","comment":"Best milk is because we have the best grass in the world. The reason for the best dairy products being Irish is directly attributed to out climate and grass"}
{"id":"hwsvj8x","author":"The_Available_Name","comment":"Easily the best. Loads of other countries have that UHT shite."}
{"id":"hwtawoo","author":"Nene-2","comment":"Ireland also has the best butter."}
{"id":"hwsx7xv","author":"FreeAndFairErections","comment":"It’s probably the highest quality i’ve ever had, although I can’t claim to be an international milk connoisseur.\n\nOne thing I don’t think people realise is just how common lactose-intolerance is across much of the world. I think we may have the lowest rate of it in the world. It’s actually quite rare in most of Asia, Africa & Latin America to be able to digest lactose. And even as you go south or east in Europe, it becomes quite common. This does make me wonder when I see us trying to push our dairy products in places like China."}
{"id":"hwsrr8e","author":"BigJoekelly69","comment":"I've travelled around so I think my answer is valid. \n\nYES no other milk has came close for me."}
{"id":"hwsym4d","author":"BrownMaltBitch","comment":"I once bought some milk in Naples in Italy, Parmalat stuff, no uht crap. That was so damn creamy."}
{"id":"hwuozqp","author":"Ed-alicious","comment":"Sure half of our mythology is about robbing cows."}
{"id":"hwt4fxx","author":"CopingMole","comment":"Very good milk. Polish milk products come close, but nothing else I've tried."}
{"id":"hwt7wkf","author":"skyactive","comment":"Milk must be at least 3.5 percent milk fat.  Unlike other countries fat can not be removed and still call the product milk.  So you can get really fatty milk sometimes that is ridiculously delicious. Ardfert Dairy is a culprit, well worth the bit of a premium price.\n\nEdit:whole milk: heat-treated milk which, with respect to fat content, meets one of the following requirements:\n standardized whole milk: milk with a fat content of at least 3.50 % (m\/m). However, Member States may provide for an additional category of whole milk with a fat content of 4.00 % (m\/m) or above ( Ireland has not made provisions for this additional category),\nnon-standardized whole milk: milk with a fat content that has not been altered since the milking stage either by the addition or removal of milk fats or by mixture with milk the natural fat content of which has been altered. However, the fat content may not be less than 3.50 % (m\/m);"}
{"id":"hwtmh8p","author":"UsuallyTalksShite","comment":"It is good. Scottish milk is also good. Same way Irish beef is really good, Scottish beef is really good. Same climate, same grass."}
{"id":"hwum5wl","author":"kingpg","comment":"The Milk Industrial Complex at work...\n\nP.s. I consume plenty of dairy"}
{"id":"hwsshga","author":null,"comment":"It's a dumb question, I know. The answer is obvious. I just wanted a cow appreciation post. Irish cows are clearly the best taken care of. Happy cows means good milk!"}
{"id":"hwszfpz","author":null,"comment":"Do you remember the milk before the enforced pasteurization? That was milk as god intended"}
{"id":"hwttppj","author":"tails142","comment":"Best milk I ever had was in Guernsey, had the cream in it. Amazing."}
{"id":"hwu482k","author":"Long-Confusion-5219","comment":"Back in the day I traveled a lot. The oul one used to buy 4L a week when I was gone. She boight 18L a week when I was back. That stuff is white gold I’ve bones like bullbars"}
{"id":"hwuy1v2","author":null,"comment":"As an American lurker on this sub, I can confirm that yes, Irish Milk and dairy products are superior\n\n(also, I’m waiting for a Terry O’Hea to get back to me, I can’t stand more of my Dad’s rambling)"}
{"id":"hwtesgu","author":null,"comment":"Yes"}
{"id":"hwuotg9","author":"The_Available_Name","comment":"Let's elevate the conversation, who's had raw milk?"}
{"id":"hwu0sz6","author":null,"comment":"Sponsored articles in the news are a problem."}
{"id":"hwtmm9f","author":"Anarchy-TM","comment":"But why does it taste like plastic tho? I mean the one in plastic canister."}
{"id":"hwtpkb4","author":"PraetorSparrow","comment":"Does the pope shit in the woods?"}
{"id":"hwu2zl9","author":"Lonely-Connection991","comment":"I dunno because I didn't try all of them but its definitely god damn amazing. Like liquid cold butter"}
{"id":"hwu7jpa","author":"MiggeldyMackDaddy","comment":"Cypriot milk is the next best. Nothing comes close to our milk though. I grew up on a dairy farm too. Loved it fresh from the milk tank."}
{"id":"hwu8pbp","author":"Basquilly","comment":"Only place I've ever had milk that came close to Irish milk was Austria"}
{"id":"hwua8xs","author":null,"comment":"Nah, I like Czech milk more. Has a more refreshing taste."}
{"id":"hwuafzd","author":"friarswalker","comment":"The milk in Switzerland is just as good as at home. Although, many Swiss still buy the long life stuff! 🤢"}
{"id":"hwubhbw","author":"Garlic_Cheese_Chips","comment":"Even a cold pint of any bog standard store brand milk is lovely."}
{"id":"hwud72v","author":"TruestRepairman27","comment":"I used to think I didn't like tea and coffee, and I didn't really like breakfast either (cereal, porridge, granola etc).   \n\n\nI realised when I left home that I actually do. What I can't stand is the UHT skimmed milk my parents drink."}
{"id":"hwueubw","author":"Roosker","comment":"Commercially, yes. But the Irish landscape is unfortunately pretty plain - the price for turning most of the land into fields. Across countries where there is more natural diversity intact, whether or not it’s left intact intentionally, I’ve had some excellent milk from animals feeding on various herbs, weeds and seasonal plants. (Though that’s rarely what you’d get commercially, having to pass regulations etc.)"}
{"id":"hwt8zgs","author":null,"comment":"Would like to say yes, but there is different standards of Irish milk. \n\nPremier dairies is not as nice as avonmore.\n\nChampion milk beats avonmore, but isn’t as widely available.\n\nNot sure about the other regional milks.\n\nHaving said that, I spent a summer on the Channel Islands, and their milk is from Jersey cows, absolutely delicious,and better than anything I have tasted in Ireland.\n\nReady for the down-votes 😶"}
{"id":"hwt3gw5","author":"fluffysugarfloss","comment":"Having tried New Zealand, Irish, Australian, and British dairy products, I rate NZ number 1, Irish number 2, Australian 3, and British last… with an honourable mention to Denmark"}
{"id":"hwt5zxr","author":"Zipper147","comment":"Yes, and everything else that comes from a farm"}
{"id":"hwt3d07","author":"colmoreilly","comment":"I'm sure we have the best but it's not for humans. It's been shown to lead to an increase in cancer. - [https:\/\/www.sciencedaily.com\/releases\/2020\/02\/200225101323.htm](https:\/\/www.sciencedaily.com\/releases\/2020\/02\/200225101323.htm)\n\nIreland needs to move to a more sustainable agriculture practice. Hemp can be grown here and as a huge range of applications which could lead to a boom in Irish agriculture and manufacturing.  - [https:\/\/hempcooperativeireland.com\/](https:\/\/hempcooperativeireland.com\/)"}
{"id":"hwvvuyt","author":"DevilCatCrochet","comment":"Australia, just saying, also, New Zealand"}
{"id":"hwszl5z","author":"softdan","comment":"No, but isn't the worst"}
{"id":"hwtktmj","author":"619C","comment":"Well considering that the male calves are killed immediately for veal and the female calves are put into the life of slavery that their mothers have endured I'd say you might be better off drinking plant milk - any plant milk like Oat Milk from Flahavans in Waterford.\n\nMammals can only produce milk after giving birth so in the case of cattle they are drugged to keep that flowing and the race in on to maximise profit so the female calves are given milk replacer.\n\nMaybe the amount of PUS in the milk needs to be checked - there is a minimum amount allowed in the EU.\n\nYou're big now you don't need to suck on the teat of an animal - any animal.\n\nCows that are dead, dying, diseased or down are sent euphimisctally to the 'factory' to make burgers."}
{"id":"hwu2wwk","author":"finnin1999","comment":"Recently tried polish milk, was a bit weird and sweet but then realised its uhc if whatever. So it doesn't have to stay in the friend and lasts like 5 months lol\n\nSo I've swapped"}
{"id":"hww3iw6","author":"GabhaNua","comment":"Irish milk is good but Jersey milk is better"}
{"id":"hwyey9c","author":"Sotex","comment":"What a great thread, just good vibes about milk."}
{"id":"hwua6s0","author":"bitterlaugh","comment":"Irish dairy is delicious, that goes without saying. \n\nHowever this article is pure propaganda for agri-business, specifically to create good vibes around the idea of our massive national herd size and its contribution to the biodiversity emergency on the island (e.g., the grass is only that green because it's been heavily boosted with nitrogen fertiliser, itself utterly destructive for habitats)."}
{"id":"hwt0p26","author":null,"comment":"Really like milk in our house 2 kids and 2 adults usage is about 3l day but when you take all fertilizer which is used to keep grass growing  there is some doubts. But definitely Irish milk products are best"}
{"id":"hwt6bjo","author":null,"comment":"A cows a cow, Milk is milk. \n\nBut nothing beats Jersey cows and jersey milk. Creamy, whole and filling like milk should be."}
{"id":"hwv0pbe","author":"Dragmire800","comment":"Yes or no, we have to drink way less of it"}
{"id":"hwup31z","author":"Iskjempe","comment":"Yes. [This](https:\/\/dontwatch.org\/) is proof."}
{"id":"hwsy006","author":null,"comment":"I think part of \"lactose intolerance\" is from all the crap large corporate producers put in milk."}
{"id":"hww39uv","author":"LastMan0ut","comment":"Dairy milk>>>any milk alternative"}
{"id":"hwtbihi","author":"calibosco","comment":"Maybe, but only because carlsberg don’t do milk"}
{"id":"hwvlht4","author":"hupouttathon","comment":"Which ones aren't made in the UK?"}
{"id":"hwvlipi","author":"hupouttathon","comment":"Which ones aren't made in the UK?"}
{"id":"hwvlkcu","author":"hupouttathon","comment":"Which ones aren't made in the UK?"}
{"id":"hww7vuc","author":"Psychology_Repulsive","comment":"Yes, had milk from other countries and irish milk is the creamiest of the creamiest.\nIce cold with a bar of dairy milk was my big treat as a kid.\nAlthough i dont eat chocolate anymore and hear that dairy milks gone to shit.\nTransfer it from the carton to a glass jug and it gets really cold."}
{"id":"hww8utv","author":"Peelie5","comment":"I've lived in China, Vietnam and currently India and travelled other Asian countries and I can safely say they do NOT mass produce the best milk.... I'm guessing Ireland wins this one due to the climate, grass etc."}
{"id":"hww9hm1","author":"soozeeee","comment":"Yes. Currently in Australia for 2.5yrs straight and craving milk and good proper butter."}
{"id":"hwwa5ru","author":null,"comment":"This is a link to an advertising feature post. Is Irish reddit the best reddit in the world?"}
{"id":"hwwbm46","author":"veryfishy1212","comment":"Yes. Golden vale all the way. Haven't had nicer anywhere....."}
{"id":"hwwes7i","author":"DontMindJustLookin","comment":"Yes. Icecream tastes more richer in Ireland."}
{"id":"hwwfd19","author":"donall","comment":"Is this a rhetorical question?"}
{"id":"hwwhgbx","author":"Gazza_s_89","comment":"NZ is up there"}
{"id":"hwtjcvw","author":"CLint_FLicker","comment":"I see those Milk Council creeps got to him too..."}
{"id":"hwsthy2","author":null,"comment":"Same."}
{"id":"hwtdlho","author":"chimpdoctor","comment":"1000% yes\nPremier dairies is the finest milk of all irish milks. \nAldi organic milk is a close second."}
{"id":"hwtpto8","author":"manowtf","comment":"How is it even a pint of contention?"}
{"id":"hwwab1b","author":"darcys_beard","comment":"Best grass in the world? Where the fuck do these notions come from? Are we champions of the grass world Cup, or something?"}
{"id":"hwvd9ju","author":"aurumae","comment":"Don’t forget best water in the world"}
{"id":"hwswfxg","author":null,"comment":"So true. American producers put so much crap in their milk, too. Unless you find a local dairy farmer your fucked"}
{"id":"hwt3l50","author":"fluffysugarfloss","comment":"UHT is disgusting 🤮"}
{"id":"hwtksez","author":"pilzenschwanzmeister","comment":"I left the country ten years ago. I'm now thoroughly lactose intolerant. UHT will eventually be discovered to be denatured toxic shite."}
{"id":"hwugkmd","author":"starkshaw","comment":"I drank UHT milk for over a decade and then came here. Still can’t forget the first time I had the milk here. I was stunned."}
{"id":"hwu2ugt","author":"tig999","comment":"What’s UHT"}
{"id":"hwwc7ov","author":"pHitzy","comment":"But there's no demand for that, 'cause it's shite."}
{"id":"hwu30fp","author":"finnin1999","comment":"I'm fairness that shite lasts like 6 months"}
{"id":"hwte5iw","author":null,"comment":"Your eggs are pretty damn great too."}
{"id":"hww2mis","author":"Cupofteaanyone","comment":"And meat. Have you ever seen in other countries the meat is advertised as grass fed. Sure what else would you feed them."}
{"id":"hwszklf","author":"blueowlcake","comment":"We do have a low rate of lactose intolerance, along with some other Northern European countries. This is owing to a genetic mutation which allows us to keep producing the lactase needed to break down the lactose. \n\nAmong people of East Asian descent, 70-100% of them are lactose intolerant in adulthood! \n\nI’ve looked into this a lot coz I am lactose intolerant!"}
{"id":"hwtc9c9","author":"theresthepolis","comment":"Yes you can do an interesting deep dive into this, but I believe within Europe anyway its to do with weather, in warmer southern Europe milk would have traditionally gone off quicker therefore they never developed thr habit of drinking it in the quantities we do which led to us essentially evolving to digest it. This is why italian cheeses are mostly hard like parmesan as they have less lactose and also why Italians see it as being uncouth to drink a cappuccino after like 10 or 11am the milk content would cause them stomach issues later in the day."}
{"id":"hwt0vu9","author":null,"comment":"This, i cant drink a glass of milk anywhere else but Ireland, GB's not bad either, and ive tried many countries, maybe NZ milk is good, never been.\n\nHomemade\/cooked chips + fried egg + glass of milk = Heaven"}
{"id":"hwth7dt","author":null,"comment":"I liked Indian milk ."}
{"id":"hwu6e1j","author":"DrWarlock","comment":"Alpine milk is a great contender too."}
{"id":"hwsxfyw","author":"BigJoekelly69","comment":"Our grass is serious as our farmers."}
{"id":"hwstkss","author":"PoppedCork","comment":"There are some terrible farmers out there as well. Don't assume all are great.  Thankfully the majority have a high standard of welfare for their animals."}
{"id":"hwsu9xz","author":"Donal1888","comment":"Screw it, have a free award for random nationalistic pride"}
{"id":"hwtl961","author":"619C","comment":"Please tell me how a cow can be 'happy' when they are forcibly impregnated to make babies that are taken from them so you can drink their mammary juice ?"}
{"id":"hwtsm40","author":"Grand_Elderberry_564","comment":"If you're ever in wexford,  pop into pettites and get some Fairfield non homogenized milk. That's it,  the cream coming to the top.  You'd drink gallons of the stuff only its so rich, fucking gorgeous!"}
{"id":"hwtdwwj","author":"chimpdoctor","comment":"Cream on top of the glass bottle with the foil lid."}
{"id":"hwt2v02","author":"I_Dont_Type","comment":"Managed to get myself a few litres of raw milk from a local farmer. It was heaven"}
{"id":"hwuj5d0","author":"emmmmceeee","comment":"You’re probably thinking of homogenisation where they pulverise they fat globules so the mill is uniform consistency. I got non homogenised milk last year in Airfield estate in Dundrum. It’s fucking gorgeous."}
{"id":"hwtyy8w","author":null,"comment":"Mmm Guernsey milk. Yes."}
{"id":"hww2fol","author":"CBVH","comment":"Yes, just the once. I live in New Zealand, and frequently pass a sort of vending machine for raw milk. There's always someone buying it."}
{"id":"hwuvpzn","author":null,"comment":"I have! It was delicious and has probiotics in it. Loved it. Just wish I could afford it."}
{"id":"hww3a5p","author":"Cupofteaanyone","comment":"You haven't had real milk till you've had beastons. Or Colostrum as some call it. \n\nIs beastons a real word? Or just something local to me?"}
{"id":"hwwc4cz","author":"ProudScientist1360","comment":"agreed.  such a huge dairy circlejerk here in the comments while over a third of our GHG emissions comes from our incredibly oversized dairy herd.  all this talk about cutting the size of the herd\/reducing methane emissions to meet our EU mandatory emissions targets is undoubtedly driving anxiety in the ag sector, hence more sponsored news articles, hence more people on reddit waxing lyrical over the most damaging sector to climate change in all of ireland."}
{"id":"hwu1q41","author":null,"comment":"It shouldn't. You should probably buy different milk."}
{"id":"hwtz2fq","author":null,"comment":"🤣 I guess he does!"}
{"id":"hww1hlb","author":"titus_1_15","comment":"Yeah not to break the circle jerk but Jersey milk is absolutely unbelievable stuff, by far the tastiest I've ever had"}
{"id":"hwtjr15","author":"TonesOakenshield","comment":"Spot the person from monaghan. \nWhere's the champion butter hey?"}
{"id":"hwygnma","author":null,"comment":"I love a big plate of slurry, just like my mam used to make"}
{"id":"hwt4llh","author":"CopingMole","comment":"I'm not putting the hemp in my tea."}
{"id":"hwtvvkb","author":"magpietribe","comment":"That study was done in the US, that stuff they drink which comes in cartons with Milk written on the outside.... it isn't Milk. The texture, viscosity, behaviour, colour, and taste are all wrong."}
{"id":"hwt6jaq","author":null,"comment":"Fuck that. 🥛👍🏻"}
{"id":"hwtr6tr","author":null,"comment":"I think there’s not enough face on the burger packets. I want to see the cute face of the animal that I am about to devour!!\nMy vote goes on more face!! \n\nAlso the higher the pus level the tastier the bainne!"}
{"id":"hwymxjh","author":"timtomtactoe","comment":"90% of your post is wrong, just so you know"}
{"id":"hwtlu8p","author":"pilzenschwanzmeister","comment":"I think we should prositute the animals before we slaughter them for meat to maximise the return on investment."}
{"id":"hwzquzu","author":"durag66","comment":"That's exactly what it is. Very surprised with the circle jerk going on in this thread"}
{"id":"hwt0qu5","author":"Guru-Pancho","comment":"No it's from the inability to produce the lactase enzyme which specially breaks down lactose. Most humans on the planet stop producing this as they get older. The fact we keep it is actually a genetic mutation originating in northern Europe. \nNothing to do with large corporate producers. And in Europe and specifically when you buy milk in Ireland. It's just milk. They don't add 'crap'."}
{"id":"hwt0ktm","author":"ThatJoeyFella","comment":"I wish it was, but it's because the ability to digest that sugar is a relatively recent human adaption that not all of us get to keep."}
{"id":"hwue9ov","author":"FthrFlffyBttm","comment":"You’d better run, milk!"}
{"id":"hwtnktt","author":null,"comment":"You seem to have misspelled Donegal Creameries"}
{"id":"hwtee82","author":"terrorSABBATH","comment":"Premier Diaries is the king. \n\nEre, if you fancy trying something a bit more \"out there\" give the Topaz\/Circle K branded milk a go."}
{"id":"hwtq2rd","author":"TheWexicano19","comment":"Where does Aldi organic milk come from? I thought there were no farms in Ireland doing organic milk. Just assumed it came in from the north. \n\nI know Glenisk obviously do organic but I thought that it was 100% allocated to yogurt production."}
{"id":"hwwf204","author":"wrapchap","comment":"Ye basically. We've the best climate and dispersion of rain. Which provides the best grass, thus the best dairy."}
{"id":"hwwn5g2","author":"oright","comment":"That's simplified but we have arguably the longest grass growing season in the world and plenty of rain to feed it. \n\nThe best microclimate and land combination is east cork\/west Waterford and the golden vale. Massive amounts of milk is produced in that area."}
{"id":"hwxcs4x","author":"Bosco_is_a_prick","comment":"It's not even a native grass and requires loads of fertiliser that pollute our waterways"}
{"id":"hwvuwtt","author":"wrapchap","comment":"Debatable"}
{"id":"hwxcvpv","author":"Bosco_is_a_prick","comment":"Ireland has some of the poorest water quality in Europe"}
{"id":"hwwdys0","author":"raamoon__","comment":"Ask that to someone from Madrid and be ready for war."}
{"id":"hwvsb69","author":"kingdel","comment":"There’s a few that aren’t bad - Sonoma Clover is the one I use over here. Oddly the most natural ones are horrendous. They come in a glass bottle with the cream on top but they’re not nice and I seem to have worse bloating and break outs."}
{"id":"hwte1zo","author":"boomerxl","comment":"Have you ever had the misfortune to taste UHT that’s turned?\n\nIt’s like white chocolate mixed with milk of magnesia and feet. One of the worse sensory experiences of my life, and I used to be a bin man."}
{"id":"hwu2zhm","author":"finnin1999","comment":"It goes off after like 5 months tho lol"}
{"id":"hwu744l","author":"bobbylafrentz","comment":"Basically, the milk is processed in a way where it's heated at high temperatures, and then it's quickly cooled down to kill all or most of the microorganisms on raw milk. These milk are pretty common in Asia can last a couple of weeks or months without it going bad"}
{"id":"hwu6le0","author":"thatblondeguy_","comment":" it's \"milk\" that's been prepared in a way that it doesn't need to be in the fridge and can be on the shelf for months, possibly years. They usually sell them in a cardboard box. Pretty much all the hot weather countries I've been to consume way more of this instead of your typical fresh milk in the fridge. In some places fresh milk is just not sold at all. Only this cardboard version"}
{"id":"hwudvef","author":"slowpokery","comment":"U Hate the Taste"}
{"id":"hwuh5le","author":"Koinzell57","comment":"Ultra high temperature. I think it’s milk that has been heated at a very high temperature to get rid of whatever bacteria so you can keep it outside of your fridge for months"}
{"id":"hwwe5l8","author":"The_Available_Name","comment":"😂 I couldn't remember the quote."}
{"id":"hwuze6h","author":"amorphatist","comment":"I read somewhere that we have the lowest rate of lactose intolerance on earth (the Danes are close)"}
{"id":"hwuf2r7","author":"murtygurty2661","comment":"I wonder what the rate of it is in countries like Mongolia who are from a similar place geographically in that they are adjacent to china and other countries with a high rate if lactose intolerance.\n\nBut they have traditionally had different sources of nutrition."}
{"id":"hwwjy99","author":"theomeny","comment":"Yes it has to do with the weather\/climate, but more in the way of milk being a valuable source of calories - in more northerly climes this was important as the growing season isn't as long as it is in the south."}
{"id":"hwt1ot7","author":"BigJoekelly69","comment":"Ye GB milk is not bad but Americans im sorry your milk is the worst Ive had in my lifetime"}
{"id":"hww28g9","author":"CBVH","comment":"NZ milk is good, but expensive."}
{"id":"hwulzqy","author":"BeardedAvenger","comment":"The beauty of our Bord Bia certification system and milk buyers requirements are that even if you wanted to be a complete heartless bastard to your livestock it's just not economically viable. You beat your cows? The meat factory you bring them to will note the bruises and you'll get less for your cows. Same goes Your cows are unhealthy and the cell count is too high in your milk? You'll get significantly less for your milk or they may not take it at all.\n\nNot to mention they do report instances of absolutely abhorrent neglect or mistreatment to the Department of Agriculture so you'd be fucked there too."}
{"id":"hwswqcr","author":null,"comment":"I think you're right. I think in general Ireland takes pride in its animals. Much more humane"}
{"id":"hwswk63","author":null,"comment":"Thanks! I thought I'd post something positive for Sunday."}
{"id":"hwu0o8e","author":null,"comment":"Fair point :("}
{"id":"hwuztkr","author":"amorphatist","comment":"The cows don’t give a fuck. They’re happy out. Source: we had a few head"}
{"id":"hwup8v9","author":"BeardedAvenger","comment":"Fairfield are only down the road from me. When the big snow hit a few years ago and the other regular milk suppliers couldn't do their deliveries Fairfield were able to make it the few kilometres into town and get their product onto shelves. I think its fair to say that their milks popularity spiked here because of it."}
{"id":"hwtnlpt","author":null,"comment":"We used to fight, who got the cream ...."}
{"id":"hwt69ea","author":null,"comment":"It really is"}
{"id":"hwt6szk","author":null,"comment":"I’ve had it right out the cows teet once when I worked on a farm in my teens. Glorious, warm and creamy, despite the smell of shite all around me on account of them dirty black and white brutes."}
{"id":"hwuwwjb","author":"The_Available_Name","comment":"It's just very hard to track down. Much nicer than anything else though."}
{"id":"hwwejdi","author":"Cleles","comment":"'Beestings'. I don't think it is local either, I've heard the name even in England too.\n\nI don't think I liked it as much though. I remember it being a little too sweet for my tastes. If I'm making tarts I'd always do one without sugar for myself, so it might be just me."}
{"id":"hwt4z6m","author":"colmoreilly","comment":"https:\/\/en.wikipedia.org\/wiki\/Hemp\\_milk"}
{"id":"hwt8uot","author":"colmoreilly","comment":"tis true. lots more information out there showing how unhealthy it can be for humans. much more money to be made by farmers if we switch to growing hemp. It's can even be used as a concrete alternative."}
{"id":"hwzc1f5","author":"619C","comment":"That's right - counteract with no counter arguement\n\n100% of it is correct - prove it otherwise - mother cows cry for days when their young are removed from them.\n\nI saw a poster the other day - an 'advertisment' - selling 'milk replacement' for calves - tell me why calves need 'milk replacement' ???\n\nWhat is wrong with their mothers milk ?\n\nOh yes that's right 'we' stick our mouths on their mammary glands and suck it dry using a machine.\n\nIsn't it time you weaned yourself off titty milk ???"}
{"id":"hx261cl","author":"bitterlaugh","comment":"Thanks: was beginning to think I was going a bit mad with the downvoting on this. Genuinely surprised myself that the presence of the word \"sponsored\" in the URL wouldn't have raised a few eyebrows. It's quite worrying the creep of industrial-style agriculture in Ireland."}
{"id":"hwt7a13","author":"skyactive","comment":"yep, Ireland won the milk dna lottery too\n\nhttps:\/\/www.sciencephoto.com\/media\/395168\/view\/lactose-tolerance-eurasia-and-africa"}
{"id":"hwtovij","author":"chimpdoctor","comment":"Have never had it. Will be holidaying up that way soon and will make sure to drink it while there."}
{"id":"hwtyoqs","author":"dysphoric-foresight","comment":"Fairfield non-homogenated milk is the best of all. Great story too. Small dairy farmer got pissed off being paid a couple of cent a litre by the big dairies so he started pasteurising, bottling and distributing it himself. It’s gorgeous - genuinely tastes like the old premier dairies glass bottle milk did."}
{"id":"hwtqkak","author":"chimpdoctor","comment":"Aldi milk 'Clonbawn' is supplied by sligo based co-op Aurivo. Glenisk do an organic milk too but I'm not too fond of it. Has a bit of a smokey taste to it (don't ask me why) doobie toking cattle."}
{"id":"hwwcxzj","author":"gifjgzxk","comment":"Fiji water has entered the chat"}
{"id":"hwtw9zc","author":"fluffysugarfloss","comment":"UHT in date is quite bad enough - reminds me of Hersheys chocolate I think I’d welcome Covid if I had to smell expired UHT"}
{"id":"hwuswvw","author":"theoldkitbag","comment":"Oh Jesus."}
{"id":"hwvrcjp","author":"blueowlcake","comment":"Be interesting to know. Gotta say I know nothing about the Mongolians. Would they traditionally have eaten a dairy heavy diet? They might have developed that genetic mutation too!"}
{"id":"hwt2hxk","author":"I_Dont_Type","comment":"The French would like a word. I don’t know how they call that ultra processed stuff milk"}
{"id":"hwu0ay9","author":null,"comment":"It is truly disgusting"}
{"id":"hwuthd8","author":"theoldkitbag","comment":"We take pride in our (performing) cows and (performing) horses. Pretty much every other animal can get fucked. Our treatment of dogs is unbelievable. A visit to a piggery would make you want to shoot yourself. And we could give two shites for 'habitats' and 'wildlife'.  \n\nI'm sorry to say it, but it's true."}
{"id":"hwtj88a","author":"TonesOakenshield","comment":"We have very strict animal welfare rules but yeah, there are always a few cowboys out there"}
{"id":"hwt9rbz","author":null,"comment":"Everything, almost, is bad for you in some way. I already drink and smoke so I’ll take my chances."}
{"id":"hwtmq83","author":"ThatJoeyFella","comment":"It looks like it was my 1.7% Scandinavian DNA that did me dirty then"}
{"id":"hwtv8kf","author":null,"comment":"Let me know your verdict. I'm by no means a milk connoisseur, I mostly just chimed in to big up my locale, but I'm genuinely curious how Donegal Creameries would stand against other milks cause I think it's superb."}
{"id":"hwtrxnv","author":"TheWexicano19","comment":"Thanks man. Appreciate that. I'm guessing Lidl is the same stuff. I use both on the regular. Never seen premiere down these parts."}
{"id":"hwwq8rw","author":"GaltBarber","comment":"Cluain Bhàn"}
{"id":"hwuu8j2","author":"thatblondeguy_","comment":"I'm in Madrid at the moment and grocery stores will have a full aisle of these cardboard milk boxes and then next to it is a tiny little fridge for normal milk, about the same size as a standard home fridge. \n\nBut at least they do have normal milk. I was in latin America a while ago and could not find any normal milk at all,  even in their big shopping centres. Probably the non stop heat makes it difficult \/ costly to transport fresh milk"}
{"id":"hwu30qn","author":"tig999","comment":"You can get gold milk in France, Brittany makes great milk but it’s more expensive, a lot of French are happy to skimp out on cheap milk in place of other things."}
{"id":"hwtehxe","author":"colmoreilly","comment":"And I am happy that you are free to make those choices for yourself. But do you think we should be advertising something without making it clear of all the possible heath risks? Smoking boxes have clear warnings."}
{"id":"hwudifq","author":"googitygig","comment":"I think everyone thinks their local milk is the best because they grow up drinking it so that's what milk is \"supposed\" to taste like."}
{"id":"hwu6s90","author":"EndOnAnyRoll","comment":"Having tried most milks available in the country, it's up there."}
{"id":"hwtt2o1","author":"chimpdoctor","comment":"Lidl milk tastes like supervalu own brand. Not great, bit of a watery sour taste. Each to their own I guess"}
{"id":"hwuukjj","author":"theoldkitbag","comment":"Makes my lips curl. Couldn't manage that at all."}
{"id":"hwtevda","author":null,"comment":"Smoking kills like 85,000 people a year in the UK and Ireland. How many people does milk kill?"}
{"id":"hwty89t","author":"TheWexicano19","comment":"I meant the Lidl organic stuff. It's all the same to me I must admit. I'm far from a connoisseur."}
{"id":"hwtli6g","author":"colmoreilly","comment":"I don't know exactly regarding just milk, but there are doctors who have treated people their whole life the traditional way, and are now committed to teaching the benefits of a plant-based diet. This guy believes diet is the leading cause of death in the world. [https:\/\/www.livekindly.co\/diet-leading-cause-death-vegan-doctor-michael-gregor\/#:\\~:text=Diet%20Is%20the%20Leading%20Cause%20of%20Death%2C%20Says%20Vegan%20Doctor%20Michael%20Greger,-By%20Lauren%20Wills&text=Dr.,be%20a%20life%2Dsaving%20decision](https:\/\/www.livekindly.co\/diet-leading-cause-death-vegan-doctor-michael-gregor\/#:~:text=Diet%20Is%20the%20Leading%20Cause%20of%20Death%2C%20Says%20Vegan%20Doctor%20Michael%20Greger,-By%20Lauren%20Wills&text=Dr.,be%20a%20life%2Dsaving%20decision).\n\nIf you are curious, I would suggested looking into Dr's Neal Barnard, John McDougal and Michal Klaper. All served as traditional doctors for decades but are now saying the same thing about food. They have nothing to profit from the lifestyle they try to promote. But big farmers and supermarkets have lots of profits to be made from selling milk, while big pharma have lots of profits to be made from selling medication to treat us afterwards."}
{"id":"hwtlzbo","author":null,"comment":"I’ll tell you, not many, or any that I could find. \n\nhttps:\/\/www.cancerresearchuk.org\/about-cancer\/causes-of-cancer\/cancer-myths\/can-milk-and-dairy-products-cause-cancer"}
{"id":"hwtn3fo","author":"colmoreilly","comment":"If you have Netflix, I would recommend watching What The Health. It shows how research organisations like these are covering everything up. It's very blatant especially in America."}
{"id":"hwtozkf","author":null,"comment":"Now you just sound like a conspiracy theorist."}
{"id":"hwtq1h4","author":"colmoreilly","comment":"Yes, I agree, I thought the same thing as I was writing it out. But the cancer research website you provided didn't link to any evidence. However I have provided research papers proving my point. Just watch what the health and you will see what I'm talking about."}
